Table of Contents
 Class IdeaVector3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A immutable class representing a point in a 3D euclidean space.
public class IdeaVector3D
Inheritance
object
IdeaVector3D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 IdeaVector3D(double, double, double)
Ctor.
public IdeaVector3D(double x, double y, double z)
Parameters
x double
X coordinate
y double
Y coordinate
z double
Z coordinate
Properties
 X
X coordinate
public double X { get; }
Property Value
double
 Y
Y coordinate
public double Y { get; }
Property Value
double
 Z
Z coordinate
public double Z { get; }
Property Value
double
 Edit this page